In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv('price_predictor_dataset.csv')

In [4]:
df.head()

,Unnamed: 0,Area,Item,Year,hg/ha_yield,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,0,Albania,Maize,1990,36613,1485,121.0,16.37,183065
1,1,Albania,Potatoes,1990,66667,1485,121.0,16.37,200001
2,2,Albania,"Rice, paddy",1990,23333,1485,121.0,16.37,139998
3,3,Albania,Sorghum,1990,12500,1485,121.0,16.37,50000
4,4,Albania,Soybeans,1990,7000,1485,121.0,16.37,56000

In [5]:
df.drop('Unnamed: 0',axis=1,inplace=True)

In [6]:
df.head()

,Area,Item,Year,hg/ha_yield,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,Albania,Maize,1990,36613,1485,121.0,16.37,183065
1,Albania,Potatoes,1990,66667,1485,121.0,16.37,200001
2,Albania,"Rice, paddy",1990,23333,1485,121.0,16.37,139998
3,Albania,Sorghum,1990,12500,1485,121.0,16.37,50000
4,Albania,Soybeans,1990,7000,1485,121.0,16.37,56000

In [7]:
df.drop('hg/ha_yield',axis=1,inplace=True) #axis=1 means This means the operation is performed along the columns

In [8]:
df.head()

,Area,Item,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,Albania,Maize,1990,1485,121.0,16.37,183065
1,Albania,Potatoes,1990,1485,121.0,16.37,200001
2,Albania,"Rice, paddy",1990,1485,121.0,16.37,139998
3,Albania,Sorghum,1990,1485,121.0,16.37,50000
4,Albania,Soybeans,1990,1485,121.0,16.37,56000

In [9]:
df.shape

(28242, 7)

In [10]:
df.isnull().sum()

Area                             0
Item                             0
Year                             0
average_rain_fall_mm_per_year    0
pesticides_tonnes                0
avg_temp                         0
Price                            0
dtype: int64

In [11]:
df.duplicated().sum()

2310

In [12]:
df.drop_duplicates(inplace=True)

In [13]:
df.duplicated().sum()

0

In [14]:
df.describe()

,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
count,25932.000000,25932.000000,25932.000000,25932.000000,2.593200e+04
mean,2001.556455,1146.836688,34782.573241,20.422251,2.001901e+05
std,7.055924,717.391098,57228.568244,6.439402,2.350081e+05
min,1990.000000,51.000000,0.040000,1.300000,0.000000e+00
25%,1995.000000,593.000000,1597.000000,16.580000,2.864400e+04
50%,2001.000000,1083.000000,15373.000000,21.420000,1.305520e+05
75%,2008.000000,1668.000000,45620.000000,26.060000,2.699640e+05
max,2013.000000,3240.000000,367778.000000,30.650000,1.504236e+06

In [15]:
def isStr(obj):
    try:
        float(obj)
        return False
    except:
        return True

In [16]:
to_drop=df[df['average_rain_fall_mm_per_year'].apply(isStr)].index

In [17]:
to_drop

Index([], dtype='int64')

In [18]:
df.drop(to_drop)

,Area,Item,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,Albania,Maize,1990,1485,121.00,16.37,183065
1,Albania,Potatoes,1990,1485,121.00,16.37,200001
2,Albania,"Rice, paddy",1990,1485,121.00,16.37,139998
3,Albania,Sorghum,1990,1485,121.00,16.37,50000
4,Albania,Soybeans,1990,1485,121.00,16.37,56000
...,...,...,...,...,...,...,...
28237,Zimbabwe,"Rice, paddy",2013,657,2550.07,19.76,135486
28238,Zimbabwe,Sorghum,2013,657,2550.07,19.76,12264
28239,Zimbabwe,Soybeans,2013,657,2550.07,19.76,105136
28240,Zimbabwe,Sweet potatoes,2013,657,2550.07,19.76,0
28241,Zimbabwe,Wheat,2013,657,2550.07,19.76,160216

In [19]:
mean_price=df[df['Price']!=0]['Price'].mean()
df['Price']=df['Price'].replace(0,mean_price)

In [20]:
hee=(df['Price']==0).any()
print(hee)

False

In [21]:
df['average_rain_fall_mm_per_year']=df['average_rain_fall_mm_per_year'].astype(np.float64) # to make this column to become float type as datatype

In [22]:
df.head()

,Area,Item,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,Albania,Maize,1990,1485.0,121.0,16.37,183065.0
1,Albania,Potatoes,1990,1485.0,121.0,16.37,200001.0
2,Albania,"Rice, paddy",1990,1485.0,121.0,16.37,139998.0
3,Albania,Sorghum,1990,1485.0,121.0,16.37,50000.0
4,Albania,Soybeans,1990,1485.0,121.0,16.37,56000.0

In [23]:
X=df.drop(columns='Price',axis=1)
y=df['Price']

In [32]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [24]:
X.head()

,Area,Item,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp
0,Albania,Maize,1990,1485.0,121.0,16.37
1,Albania,Potatoes,1990,1485.0,121.0,16.37
2,Albania,"Rice, paddy",1990,1485.0,121.0,16.37
3,Albania,Sorghum,1990,1485.0,121.0,16.37
4,Albania,Soybeans,1990,1485.0,121.0,16.37

In [25]:
y.head()

0    183065.0
1    200001.0
2    139998.0
3     50000.0
4     56000.0
Name: Price, dtype: float64

In [26]:
from sklearn.preprocessing import StandardScaler,OneHotEncoder
from sklearn.compose import ColumnTransformer # it is tool that allows you to apply different preprocessing or transformation steps to specific columns in a dataset

In [27]:
ohe=OneHotEncoder(drop='first')
# it drops the first category of each feature to avoid the "dummy variable trap," where one feature is highly correlated with others.
scaler=StandardScaler()

In [28]:
df.head()

,Area,Item,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Price
0,Albania,Maize,1990,1485.0,121.0,16.37,183065.0
1,Albania,Potatoes,1990,1485.0,121.0,16.37,200001.0
2,Albania,"Rice, paddy",1990,1485.0,121.0,16.37,139998.0
3,Albania,Sorghum,1990,1485.0,121.0,16.37,50000.0
4,Albania,Soybeans,1990,1485.0,121.0,16.37,56000.0

In [30]:
preprocessor=ColumnTransformer(
    transformers=[
        ('onehotencoder',ohe,[0, 1]), # 4 and 5 is the index for which we need to apply the onehotccoding
        ('standardization',scaler,[2, 3, 4, 5]) 
    ],
    remainder='passthrough' # we are telling that do not toucch 6 coulumn in that just pass through without touching this
)

In [33]:
X_train_dummy=preprocessor.fit_transform(X_train)
X_test_dummy=preprocessor.transform(X_test)

In [35]:
from sklearn.linear_model import LinearRegression,    Lasso,Ridge
from sklearn.ensemble  import RandomForestRegressor, AdaBoostRegressor
from sklearn.tree import DecisionTreeRegressor
from sklearn.metrics import mean_squared_error,r2_score

In [39]:
import numpy as np
import pandas as pd
from sklearn.ensemble import AdaBoostRegressor, GradientBoostingRegressor, RandomForestRegressor
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import OneHotEncoder, StandardScaler
import pickle

# Load the dataset
data = pd.read_csv('price_predictor_dataset.csv')

# Rename columns for easier referencing
data.rename(columns={
    'hg/ha_yield': 'Yield',
    'average_rain_fall_mm_per_year': 'Rainfall',
    'pesticides_tonnes': 'Pesticides',
    'avg_temp': 'Temperature'
}, inplace=True)

# Separate features and target variables
X = data.drop(columns=['Yield', 'Price', 'Unnamed: 0'])
y_yield = data['Yield']
y_price = data['Price']

# Split the dataset for both yield and price predictions
X_train_yield, X_test_yield, y_train_yield, y_test_yield = train_test_split(X, y_yield, test_size=0.2, random_state=42)
X_train_price, X_test_price, y_train_price, y_test_price = train_test_split(X, y_price, test_size=0.2, random_state=42)

# Preprocessor for categorical and numerical data
categorical_features = ['Area', 'Item']
numerical_features = ['Year', 'Rainfall', 'Pesticides', 'Temperature']

preprocessor = ColumnTransformer(
    transformers=[
        ('cat', OneHotEncoder(), categorical_features),
        ('num', StandardScaler(), numerical_features)
    ]
)

# Models for ensembling
ensemble_models = {
    'ada': AdaBoostRegressor(n_estimators=50, random_state=42),
    'gbr': GradientBoostingRegressor(n_estimators=100, max_depth=3, random_state=42),
    'rfr': RandomForestRegressor(n_estimators=100, max_depth=10, random_state=42)
}

# Function to train and evaluate models
def train_and_evaluate(models, X_train, X_test, y_train, y_test):
    pipelines = {}
    for name, model in models.items():
        pipeline = Pipeline([
            ('preprocessor', preprocessor),
            ('model', model)
        ])
        pipeline.fit(X_train, y_train)
        predictions = pipeline.predict(X_test)
        mse = mean_squared_error(y_test, predictions)
        print(f'{name} Model MSE: {mse}')
        pipelines[name] = pipeline
    return pipelines

# Train and evaluate models for Yield
print("Training models for Yield prediction:")
yield_models = train_and_evaluate(ensemble_models, X_train_yield, X_test_yield, y_train_yield, y_test_yield)

# Train and evaluate models for Price
print("\nTraining models for Price prediction:")
price_models = train_and_evaluate(ensemble_models, X_train_price, X_test_price, y_train_price, y_test_price)

# Save the best models (e.g., Random Forest for Yield and Gradient Boosting for Price)
with open('yield_model.pkl', 'wb') as f:
    pickle.dump(yield_models['rfr'], f)

with open('price_model.pkl', 'wb') as f:
    pickle.dump(price_models['gbr'], f)

# Save the preprocessor
with open('preprocessor.pkl', 'wb') as f:
    pickle.dump(preprocessor, f)

Training models for Yield prediction:
ada Model MSE: 3737863419.4499097
gbr Model MSE: 919466056.1923125
rfr Model MSE: 402643021.0789681

Training models for Price prediction:
ada Model MSE: 18868267236.947388
gbr Model MSE: 6447817926.590493
rfr Model MSE: 3169384965.7513456